# SetUnitTypeId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormatOptions..::..SetUnitTypeId Method
FormatOptions Class See Also
---
Sets the unit used to quantify values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public FormatOptions SetUnitTypeId(
	ForgeTypeId unitTypeId
)
```

Visual Basic
---
```text
Public Function SetUnitTypeId ( _
	unitTypeId As ForgeTypeId _
) As FormatOptions
```

Visual C++
---
```text
public:
FormatOptions^ SetUnitTypeId(
	ForgeTypeId^ unitTypeId
)
```

# ### Parameters
unitTypeId
    Type: Autodesk.Revit.DB..::..ForgeTypeId The unit identifier.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType). |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | UseDefault is true in this FormatOptions. |

# See Also
FormatOptions Class
Autodesk.Revit.DB Namespace